Catalogs/АС_ГруппыСинонимовПоиска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АС_ГруппыСинонимовПоиска</Name>
			<Comment>Группы равнозначных слов и сокращений для поиска номенклатуры.</Comment>
			<Hierarchical>false</Hierarchical><HierarchyType>HierarchyFoldersAndItems</HierarchyType><LimitLevelCount>false</LimitLevelCount><LevelCount>2</LevelCount>			<UseStandardCommands>true</UseStandardCommands><Owners/>			<CodeLength>0</CodeLength><DescriptionLength>100</DescriptionLength><CodeType>String</CodeType><CodeAllowedLength>Variable</CodeAllowedLength><CodeSeries>WholeCatalog</CodeSeries><CheckUnique>false</CheckUnique><Autonumbering>false</Autonumbering>			<Characteristics/><PredefinedDataUpdate>Auto</PredefinedDataUpdate><EditType>InDialog</EditType><QuickChoice>false</QuickChoice>			<SearchStringModeOnInputByString>AnyPart</SearchStringModeOnInputByString><FullTextSearchOnInputByString>DontUse</FullTextSearchOnInputByString>			<DefaultObjectForm/><DefaultFolderForm/><DefaultListForm/><DefaultChoiceForm/><DefaultFolderChoiceForm/><AuxiliaryObjectForm/><AuxiliaryFolderForm/><AuxiliaryListForm/><AuxiliaryChoiceForm/>			<IncludeHelpInContents>false</IncludeHelpInContents><BasedOn/><DataLockFields/><DataLockControlMode>Managed</DataLockControlMode>			<ObjectPresentation><v8:item><v8:lang>ru</v8:lang><v8:content>Группа синонимов</v8:content></v8:item></ObjectPresentation>			<ListPresentation><v8:item><v8:lang>ru</v8:lang><v8:content>Синонимы для поиска</v8:content></v8:item></ListPresentation><ExtendedListPresentation/>			<CreateOnInput>Use</CreateOnInput><ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput><DataHistory>Use</DataHistory><UpdateDataHistoryImmediatelyAfterWrite>false</UpdateDataHistoryImmediatelyAfterWrite>		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Синонимы</Name>					<Comment>Равнозначные слова и сокращения. Например: ремкомплект, РК, рем.комплект.</Comment><ToolTip/>					<Use>ForItem</Use>				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>							<Comment>Слово, сокращение или фраза, равнозначные другим строкам группы.</Comment>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>150</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
							<PasswordMode>false</PasswordMode><Format/><EditFormat/><ToolTip/><MarkNegatives>false</MarkNegatives><Mask/><MultiLine>false</MultiLine><ExtendedEdit>false</ExtendedEdit><MinValue xsi:nil="true"/><MaxValue xsi:nil="true"/><FillChecking>ShowError</FillChecking><ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems><ChoiceParameterLinks/><ChoiceParameters/><QuickChoice>Auto</QuickChoice><CreateOnInput>Auto</CreateOnInput><ChoiceForm/><LinkByType/><ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput><Indexing>DontIndex</Indexing><FullTextSearch>Use</FullTextSearch>						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/АС_ГруппыСинонимовПоиска/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)

	ИспользованныеКлючи = Новый Соответствие;
	ИспользованныеЗначения = Новый Соответствие;
	КлючНаименования = АС_СинонимыПоискаСервер.НормализоватьСтроку(Наименование);
	Если ПустаяСтрока(КлючНаименования) Тогда
		Сообщить("Укажите наименование группы синонимов.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ИспользованныеКлючи.Вставить(КлючНаименования, Наименование);
	ИспользованныеЗначения.Вставить(НРег(СокрЛП(Наименование)), Наименование);

	Для Каждого СтрокаСинонима Из Синонимы Цикл
		КлючСинонима = АС_СинонимыПоискаСервер.НормализоватьСтроку(СтрокаСинонима.Синоним);
		Если ПустаяСтрока(КлючСинонима) Тогда
			Сообщить("В таблице синонимов есть пустая строка.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		КлючЗначения = НРег(СокрЛП(СтрокаСинонима.Синоним));
		Если ИспользованныеЗначения.Получить(КлючЗначения) <> Неопределено Тогда
			Сообщить("Синоним повторяется внутри группы: " + СтрокаСинонима.Синоним);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		ИспользованныеЗначения.Вставить(КлючЗначения, СтрокаСинонима.Синоним);
		Если ИспользованныеКлючи.Получить(КлючСинонима) = Неопределено Тогда
			ИспользованныеКлючи.Вставить(КлючСинонима, СтрокаСинонима.Синоним);
		КонецЕсли;
	КонецЦикла;

	Если ИспользованныеЗначения.Количество() < 2 Тогда
		Сообщить("Добавьте хотя бы один синоним к наименованию группы.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|Группы.Ссылка КАК Группа,
		|Группы.Наименование КАК Синоним
		|ИЗ
		|Справочник.АС_ГруппыСинонимовПоиска КАК Группы
		|ГДЕ
		|Группы.Ссылка <> &ТекущаяГруппа
		|И НЕ Группы.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|Группы.Ссылка,
		|ГруппыСинонимы.Синоним
		|ИЗ
		|Справочник.АС_ГруппыСинонимовПоиска КАК Группы
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АС_ГруппыСинонимовПоиска.Синонимы КАК ГруппыСинонимы
		|ПО Группы.Ссылка = ГруппыСинонимы.Ссылка
		|ГДЕ
		|Группы.Ссылка <> &ТекущаяГруппа
		|И НЕ Группы.ПометкаУдаления");
	Запрос.УстановитьПараметр("ТекущаяГруппа", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		КлючСинонима = АС_СинонимыПоискаСервер.НормализоватьСтроку(Выборка.Синоним);
		Если ИспользованныеКлючи.Получить(КлючСинонима) <> Неопределено Тогда
			Сообщить("Синоним уже используется в другой группе: " + Выборка.Синоним);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
